export const firstChar = [
  "ㄱ",
  "ㄲ",
  "ㄴ",
  "ㄷ",
  "ㄸ",
  "ㄹ",
  "ㅁ",
  "ㅂ",
  "ㅃ",
  "ㅅ",
  "ㅆ",
  "ㅇ",
  "ㅈ",
  "ㅉ",
  "ㅊ",
  "ㅋ",
  "ㅌ",
  "ㅍ",
  "ㅎ",
];

export const midChar = [
  "ㅏ", // 0
  "ㅐ", // 1
  "ㅑ", // 2
  "ㅒ", // 3
  "ㅓ", // 4
  "ㅔ", // 5
  "ㅕ", // 6
  "ㅖ", // 7
  "ㅗ", // 8
  "ㅘ", // 9 sep
  "ㅙ", // 10 sep
  "ㅚ", // 11 sep
  "ㅛ", // 12
  "ㅜ", // 13
  "ㅝ", // 14 sep
  "ㅞ", // 15 sep
  "ㅟ", // 16 sep
  "ㅠ", // 17
  "ㅡ", // 18
  "ㅢ", // 19 sep
  "ㅣ", // 20
];

export const lastChar = [
  "", // 0
  "ㄱ", // 1
  "ㄲ", // 2
  "ㄳ", // 3 sep
  "ㄴ", // 4
  "ㄵ", // 5 sep
  "ㄶ", // 6 sep
  "ㄷ", // 7
  "ㄹ", // 8
  "ㄺ", // 9 sep
  "ㄻ", // 10 sep
  "ㄼ", // 11 sep
  "ㄽ", // 12 sep
  "ㄾ", // 13 sep
  "ㄿ", // 14 sep
  "ㅀ", // 15 sep
  "ㅁ", // 16
  "ㅂ", // 17
  "ㅄ", // 18 sep
  "ㅅ", // 19
  "ㅆ", // 20
  "ㅇ", // 21
  "ㅈ", // 22
  "ㅊ", // 23
  "ㅋ", // 24
  "ㅌ", // 25
  "ㅍ", // 26
  "ㅎ", // 27
];
